# Fix Incomplete Data

In [85]:
import pandas as pd
import numpy as np

In [86]:
# Create Dummy Data
stuff = {"A": [1,2,3], "B": [4, np.nan, 6], "C": [7, 8, 9], "D": [10, 11, 12]}
df = pd.DataFrame(stuff)
df

   A    B  C   D
0  1  4.0  7  10
1  2  NaN  8  11
2  3  6.0  9  12

## Drop Rows with null data

In [87]:
# Drop Rows with null data
df.dropna()

   A    B  C   D
0  1  4.0  7  10
2  3  6.0  9  12

## Drop Columns with null data

In [88]:
# Drop Columns with null data
df.dropna(axis=1)

   A  C   D
0  1  7  10
1  2  8  11
2  3  9  12

## Not permanent, inplace=False (default)

In [89]:
# Not permanent, inplace=False (default)
df.dropna(axis=1, inplace=False)
df

   A    B  C   D
0  1  4.0  7  10
1  2  NaN  8  11
2  3  6.0  9  12

## More than one? Set Threshold
thres=int (optional)

In [90]:
# More than one? Set Threshold
# Drop column 2 if nan found
df.dropna(axis=1, thresh=2)

   A    B  C   D
0  1  4.0  7  10
1  2  NaN  8  11
2  3  6.0  9  12

## Replace thins with fillna()

In [91]:
# Replace thins with fillna()
# replace with value "Bob"
df.fillna(value="Bob")

   A    B  C   D
0  1  4.0  7  10
1  2  Bob  8  11
2  3  6.0  9  12

In [92]:
# Replace thins with fillna()
# replace with value 99
df.fillna(value=99)

   A     B  C   D
0  1   4.0  7  10
1  2  99.0  8  11
2  3   6.0  9  12

## Use Math functions

In [93]:
# Use Math functions (mean)
df.fillna(value=df.B.mean())

   A    B  C   D
0  1  4.0  7  10
1  2  5.0  8  11
2  3  6.0  9  12

In [94]:
# Use Math functions (min)
df.fillna(value=df.B.min())

   A    B  C   D
0  1  4.0  7  10
1  2  4.0  8  11
2  3  6.0  9  12

In [95]:
# Use Math functions (max)
df.fillna(value=df.B.max())

   A    B  C   D
0  1  4.0  7  10
1  2  6.0  8  11
2  3  6.0  9  12

In [96]:
# Use Math functions (sum)
df.fillna(value=df.B.sum())

   A     B  C   D
0  1   4.0  7  10
1  2  10.0  8  11
2  3   6.0  9  12